/*
Ö¸Õë--Êı¾İµØÖ·£¬Ò»ÖÖÊı¾İÀàĞÍ
Ö¸Õë±äÁ¿--Ö¸ÕëµÄÖµ
½¨Á¢Ö¸Õë£ºÀûÓÃ¸÷ÖÖÀàĞÍ¶¨Òå
eg.int *p1,p2;
   int *char1,*float2;
Ç°Õß½¨Á¢1¸öÖ¸Õë£¬Ò»¸öÕûĞÍ±äÁ¿£¬ºóÕß½¨Á¢2¸öÖ¸Õë 
Ö¸ÕëÊ¹ÓÃÇ°³õÊ¼»¯
eg.int a=26;
   int *p1=&a;  //"&"·ûºÅÈ¡µØÖ·£¬²¢³õÊ¼»¯
   int *p;
   *p=&a;  //ÕâÑù¸³ÖµÒ²¿ÉÒÔ
eg.int a;
   int *p1;
   *p1=20  //Î´¸³³õÖµ£¬´íÎó£¡
pÖ¸Ïòa£¬*pºÍaÖµÏàÍ¬
eg.int a=20;
   int *p=&a;
   printf("The value of p is:%d.",*p);  //Êä³öThe value of p is:20.
Ö¸Õë±äÁ¿µÄ¸³Öµ
eg.int a=2,*pa=&a,*pb;
   int pb=pa;  //Ö¸ÕëÖ¸ÕëµÄ¶¨Òå¸³Öµ
   int a=2,*pa=&a,*pb;
   int pb=pa;  //µÈ¼ÛÓÚÉÏÊ½
eg.int a[5],*pa;
   pa=a;  //Êı×éÖ¸ÕëµÄ¶¨Òå¸³Öµ
   int a[5],*pa;
   pa=&a[0];  //µÈ¼ÛÓÚÉÏÊ½
eg.char *pc="C Language"  //×Ö·û´®Ö¸ÕëµÄ¶¨Òå¸³Öµ
eg.int (*pf)();
   pf=f;  //º¯ÊıÖ¸ÕëµÄ¶¨Òå¸³Öµ£¬fÊÇº¯ÊıÃû
eg.Öµ½»»»
    int a=1,b=2,c;
    int *p1=&a,*p2=&b;
    cout<<"p1="<<*p1<<"\t"<<"p2="<<*p2<<endl;
    c=*p1;
	*p1=*p2;
	*p2=c;
	cout<<"p1="<<*p1<<"\t"<<"p2="<<*p2<<endl;
	return 0;  //¸Ä±äa,bÖµ 
	int a=1,b=2;
    int *p1=&a,*p2=&b,*p;
    cout<<"p1="<<*p1<<"\t"<<"p2="<<*p2<<endl;
    p=p1;
	p1=p2;
	p2=p;
	cout<<"p1="<<*p1<<"\t"<<"p2="<<*p2<<endl;
	return 0;  //²»¸Ä±äa,bÖµ 
Êı×é¸³ÖµÊ±£¬p+iºÍa+iÖ¸a[i]µØÖ·£¬¼´&a[i]
*(p+i)Óë*(a+i)µÈ¼Û£¬Ö¸Ïòa[i]
Ö»ÓĞÖ¸ÏòÊı×éµÄÖ¸Õë±äÁ¿¿ÉÒÔ¼Ó¼õÔËËã£¬Êı×é·ÃÎÊÔËÓÃÖ¸Õë¸ü·½±ã
*p++µÈ¼Û*(p++)£¬ÏÈÈ¡³öpËùÖ¸µØÖ·µÄÄÚÈİ*p£¬ÔÙÊ¹p+1Îªp
*++pµÈ¼Û*(++p)£¬ÏÈp+1Îªp£¬ÔÙÈ¡³öÊ¹pËùÖ¸µØÖ·µÄÄÚÈİ*p
*(p)++£¬ÏÈÈ¡³öpËùÖ¸µØÖ·µÄÄÚÈİ(*p)£¬ÔÙÊ¹pËùÓĞÖµ+1
Êı×éÃû²»ÄÜ¸³Öµ¡¢ÔËËã 
eg.Ö¸ÕëËãÊıÔËËã
    int a[5],i,*p=a;
    for(i=0;i<5;i++){
    	*p=i;  //ÀûÓÃÖ¸Õë¸³ÖµÊ¹a[i]=i 
		p++;  //²»¶ÏÔö¼Ó£¬pÖ¸Ïòa[1],a[2],a[3],a[4]
	}
	p=a;  //ÔÙ´Î³õÊ¼»¯£¬½«pÓÉa[5]×ªÎªa[0] 
	for(i=0;i<5;i++){
    	printf("a[%d]=%d\n",i,*p++); //´òÓ¡³öpÖ¸ÏòµÄa[0]£¬ÔÙÒÆÖÁa[1]£¬Ó¡³öpÖ¸ÏòµÄa[1]£¬ÒÔ´ËÀàÍÆ
	}
	return 0;
eg.Ö¸ÕëµÄ¼Ó¼õ
    int a[5]={5,20,8,6,13},*p1=&a[1],*p2=&a[4];
    printf("%d,%d\n",*p1,*p2);
    printf("%d\n",*p1-*p2);
    printf("%d\n",p1-p2);  //´òÓ¡Î»ÖÃ²îÖµ
Ö¸Õë±È½ÏÓÃµØÖ·±È½Ï*p1=&a[1],*p2=&a[3],Ôòp1<p2
eg.int a[5]={5,20,8,6,13},*p1=&a[1],*p2=&a[3],*p3;
	if(p1>p2){
		p3=p1;  //p1ÔÚµÍÎ»Ìø¹ıifÔËĞĞelse
	}
	else p3=p2; 
    printf("%d\n",*p3);  //p3=p2=a[3]=6 
    p1=p1+3,p2=p2-3;  //p1±äÎªa[4],p2±äÎªa[1] 
    if(p1>p2){
		p3=p1;  //p1ÔÚ¸ßÎ»ÔËĞĞif
	}Å
	else p3=p2;
    printf("%d\n",*p3);  //p3=p1=a[4]=13
	return 0;
*/
#include<iostream>
using namespace std;
int main(){
	int a[5]={5,20,8,6,13},*p1=&a[1],*p2=&a[3],*p3;
	if(p1>p2){
		p3=p1;
	}
	else p3=p2; 
    printf("%d\n",*p3);
    p1=p1+3,p2=p2-3;
    if(p1>p2){
		p3=p1;
	}
	else p3=p2;
    printf("%d\n",*p3);
	return 0;
}
